In [92]:
import numpy as np
import pandas as pd

In [98]:
my_dict = { 
     'name' : ["a", "b", "c", "d", "e",0 , "g"],
     'age' : [20,27, 35, 55, 18, np.nan, 35],
     'designation': ["VP", "?", "CFO", "VP", "VP", "CEO", "MD"],
      'Year':[1990,1991,1992,1993,1994,1995,1996]
}

In [94]:
df = pd.DataFrame(my_dict)
df

  name   age designation  Year
0    a  20.0          VP  1990
1    b  27.0           ?  1991
2    c  35.0         CFO  1992
3    d  55.0          VP  1993
4    e  18.0          VP  1994
5    0   NaN         CEO  1995
6    g  35.0          MD  1996

In [95]:
df.dtypes

name            object
age            float64
designation     object
Year             int64
dtype: object

In [96]:
missing_data=df.isnull()
missing_data

    name    age  designation   Year
0  False  False        False  False
1  False  False        False  False
2  False  False        False  False
3  False  False        False  False
4  False  False        False  False
5  False   True        False  False
6  False  False        False  False

In [99]:
df.replace(['?',0],np.nan,inplace = True)
df

  name   age designation  Year
0    a  20.0          VP  1990
1    b  27.0         NaN  1991
2    c  35.0         CFO  1992
3    d  55.0          VP  1993
4    e  18.0          VP  1994
5  NaN   NaN         CEO  1995
6    g  35.0          MD  1996

In [100]:
missing_data2 = df.isnull()
missing_data2

    name    age  designation   Year
0  False  False        False  False
1  False  False         True  False
2  False  False        False  False
3  False  False        False  False
4  False  False        False  False
5   True   True        False  False
6  False  False        False  False

In [101]:
for column in missing_data2.columns.values.tolist():
    print(column)
    print(missing_data2[column].value_counts())
    print("")

name
False    6
True     1
Name: name, dtype: int64

age
False    6
True     1
Name: age, dtype: int64

designation
False    6
True     1
Name: designation, dtype: int64

Year
False    7
Name: Year, dtype: int64

In [102]:
df.dropna(subset=['name'] ,axis = 0,inplace = True)

In [103]:
df

  name   age designation  Year
0    a  20.0          VP  1990
1    b  27.0         NaN  1991
2    c  35.0         CFO  1992
3    d  55.0          VP  1993
4    e  18.0          VP  1994
6    g  35.0          MD  1996

In [104]:
df.reset_index(drop = True,inplace = True)

In [42]:
df

  name   age designation  Year
0    a  20.0          VP  1990
1    b  27.0         NaN  1991
2    c  35.0         CFO  1992
3    d  55.0          VP  1993
4    e  18.0          VP  1994
5    g  35.0          MD  1996

In [105]:
df.drop('designation' , axis =1 ,inplace = True)

In [106]:
df

  name   age  Year
0    a  20.0  1990
1    b  27.0  1991
2    c  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    g  35.0  1996

In [107]:
df['age'].replace(20.0,np.nan,inplace = True)

In [110]:
df

  name   age  Year
0    a   NaN  1990
1    b  27.0  1991
2    c  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    g  35.0  1996

In [111]:
df.dtypes

name     object
age     float64
Year      int64
dtype: object

In [109]:
age_mean= df['age'].mean()
age_mean

34.0

In [112]:
df['age'].replace(np.nan,age_mean,inplace=True)
df

  name   age  Year
0    a  34.0  1990
1    b  27.0  1991
2    c  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    g  35.0  1996

In [113]:
df['name'].replace(['a','b','c'],'d',inplace = True)
df

  name   age  Year
0    d  34.0  1990
1    d  27.0  1991
2    d  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    g  35.0  1996

In [114]:
missing_data = df.isnull()
missing_data

    name    age   Year
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

In [115]:
missing_data['name'].value_counts()

False    6
Name: name, dtype: int64

In [116]:
missing_data['name'].value_counts().idxmax()

False

In [117]:
freq = df['name'].value_counts().idxmax()
freq

'd'

In [56]:
df

  name   age  Year
0    d  34.0  1990
1    d  27.0  1991
2    d  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    g  35.0  1996

In [118]:
df['name'].replace('g',freq,inplace = True)
df

  name   age  Year
0    d  34.0  1990
1    d  27.0  1991
2    d  35.0  1992
3    d  55.0  1993
4    e  18.0  1994
5    d  35.0  1996

In [119]:
df.dtypes

name     object
age     float64
Year      int64
dtype: object

In [129]:
avg_year = df['Year'].astype('float').mean(axis = 0)
avg_year

1993.1666666666667

In [130]:
df.dtypes

name     object
age     float64
Year      int64
dtype: object

In [131]:
df['Year'].replace(1995,avg_year,inplace = True)

In [132]:
df

  name   age         Year
0    d  34.0  1990.000000
1    d  27.0  1991.000000
2    d  35.0  1993.166667
3    d  55.0  1993.000000
4    e  18.0  1994.000000
5    d  35.0  1996.000000

In [126]:
df.dtypes

name     object
age     float64
Year      int64
dtype: object

In [133]:
df['Year'].replace(1994,int(avg_year),inplace = True)

In [134]:
df

  name   age         Year
0    d  34.0  1990.000000
1    d  27.0  1991.000000
2    d  35.0  1993.166667
3    d  55.0  1993.000000
4    e  18.0  1993.000000
5    d  35.0  1996.000000

In [135]:
df.dtypes

name     object
age     float64
Year    float64
dtype: object

In [136]:
df['Year'] = df['Year'].astype('int')
df.dtypes

name     object
age     float64
Year      int64
dtype: object

In [137]:
df

  name   age  Year
0    d  34.0  1990
1    d  27.0  1991
2    d  35.0  1993
3    d  55.0  1993
4    e  18.0  1993
5    d  35.0  1996